import OpenAI from 'openai';
import * as dotenv from "dotenv"
dotenv.config()
// not finished yet

// findTopic("細胞核")

export async function findTopic(text) {
	console.log(`sending ${text}`)
	const openai = new OpenAI({
		apiKey: process.env.OPENAI_API_KEY, // defaults to process.env["OPENAI_API_KEY"]
	});

	const saySomething = `假設你是一名圖書館管理員，圖書館中有下列書籍，書籍資料以json array 儲存
	'["課程名稱","生命現象概論","生命現象 代謝","從肥胖看生命現象之生長現象","生命現象 感應與運動","生命現象 繁殖","細胞的發現與細胞學說","細胞的大小(內有有趣的網站)","科學方法(歌)","組成細胞的分子概論","組成細胞的分子 水","組成細胞的分子 礦物質","組成細胞的分子 醣類","組成細胞的分子 脂質","組成細胞的分子 蛋白質","組成細胞的分子 核酸","從房間的概念看細胞","真核細胞與原核細胞的比較","真核細胞的基本構造 細胞膜與細胞壁","真核細胞的基本構造 細胞核","真核細胞的基本構造 細胞質與胞器的簡介","胞器介紹 非膜狀構造：核糖體與中心粒","胞器介紹 單層膜狀胞器：內質網、高基氏體、液泡","胞器介紹 雙層膜狀胞器：粒腺體與葉綠體","半透膜的定義與細胞膜脂雙層的通透性","被動運輸 簡單擴散","被動運輸 促進擴散","主動運輸","滲透作用","滲透作用對細胞的影響","細胞中的化學反應","酵素","ATP的結構與功能","ATP的水解與合成","光合作用的場所-葉綠體","光合作用-光反應與碳反應","NADPH-光反應與暗反應之間的橋梁","呼吸作用與發酵作用1","呼吸作用與發酵作用2","細胞生","染色體的發現與形態","染色體的數目與類型(性、體染色體；同源、姐妹染色體)","有絲分裂(請練習繪製示意圖)","有絲分裂的過程與相關構造","動植物細胞有絲分裂的比較","為何要減數分裂-單倍體-雙倍體","減數分裂(請練習繪製示意圖)","減數分裂的階段與套數問題","聯會-減數分裂的特有現象","減數分裂與有絲分裂的比較","人體的減數分裂 精子卵子的產生","細","【專欄】無合成分裂：斑馬魚難以察覺","志玲姐姐的雙眼皮-遺傳學簡介","性狀與表徵；孟德爾與豌豆","單性雜交實驗-過程與結果","豌豆實驗的「互交」","分離律-單性雜交實驗結論","兩性雜交實驗-過程與結果","獨立分配律-兩性雜交實驗結論","基因、基因型、表現型","用基因與染色體解釋分離律與獨立分配律","試交 確認第一子代的基因型","單基因遺傳-顯性遺傳(各種基因型之討論)","單基因遺傳-中間型遺傳(不完全顯性)","單基因遺傳-等顯性遺傳(ABO血型)","單基因遺傳-性聯遺傳(紅綠色盲與父母的關係)","多基因遺傳-人類的身高與膚色","性","遺傳的染色體學說","連鎖群","DNA雙股螺旋構造與半保留複製","基因、DNA與染色體的關係","從基因到性狀 分子生物學的中心法則","【實驗】基因檢測｜啾啾鞋的邊緣基因哪裡來？＜實驗科學吧＞","細菌的染色體與質體","重組DNA 產生胰島素的細菌","基因轉殖技術的應用","遺傳物質","遺傳物質與","【延伸】基因工程｜ROAR～重建侏儸紀公園的恐龍復活教戰手冊！？＜實驗科學吧＞","演化論前言-演化論的誤解","創造論(神創說)","拉馬克的演化理論(用進廢退說)","達爾文演化思想的孕育","達爾文的演化理論(天擇說)","用進廢退說vs.天擇說","【探究】天","現代的演化理論","抗藥性","生物種的概念","生","生物分類系統的演進","生命樹與親緣關係","親緣關係的證據1-同源與痕跡構造","親緣關係的證據2-化石","親緣關係的證據3-地理分布情形","親緣關係的證據4-分子生物學證據","親緣關係的可重建性","病毒的定位","生物多樣性","遺傳多樣性","物種多樣性","生態系多樣性","維持生物多樣性的重要","生物多樣性面臨的挑戰","生","植物的演化","草本植物的莖","木本莖與變態莖","植物的營養器官─葉","植物葉的變態","植物的","營養構造表格","植物維管束木質部的運輸(水分無機鹽離子)","植物維管束韌皮部的物質運輸(有機養分)","營養構","植物的無性生殖","植物花的構造與授粉作用","植物的世代交替與被子植物的有性生殖","果實與種子的發育","果實與種子的傳播","生殖構","簡介植物對環境刺激的反應","植物的向性運動","植物的傾性運動","植物的光週期性","植物的春化作用","對","對環境刺","循環系統介紹","心臟的結構","心搏週期","血管的結構與功能","血壓","血液循環和淋巴循環","動物的","消化作用與消化系統種類","人體的營養需求","人體的消化系統與功能","人體養分的吸收與運輸","肝臟的功能","動物的","動物的呼吸器官","人類的呼吸系統","人體的呼吸運動","氣體的交換與運輸","動物的","排泄系統與腎臟","腎元","尿液的形成","動物的","防禦","皮膜防禦","吞噬作用、發炎反應","淋巴系統、初級淋巴器官、次級淋巴器官","專一性防禦介紹","體液免疫、細胞免疫","免疫記憶","動物的","男性生殖系統","女性生殖系統","月經週期","人類配子的形成","受精、卵裂、胚胎發育","動物的","協調作用簡介","神經系統的功能總覽","神經元與神經膠細胞","中樞神經系統─腦的簡要介紹","中樞神經系統─脊髓","周圍神經系統─腦神經與脊髓神經","神經系統的反射","隨意運動","動物的","內分泌腺與激素的簡介","腦垂腺","甲狀腺與副甲狀腺","胰島素、升糖素與血糖調節","腎上腺與激素","性腺激素","動","動物的內","【專欄】珊瑚為何會同時間大量產卵？關鍵在日落到","生態系的生物與非生物因子","食物鏈與食物網","動物組織的簡介","結締組織","結締組織   骨骼","血液","肌肉組織","神經組織","植物的組織與細胞","植物的分生組織","植物的表皮組織","植物的維管束組織","生物體內常見的糖類（構造與功能）","生物體的有機化合物（蛋白質）","脂質","真核生物的細胞骨架","中心體","內膜系統","半自主胞器（粒線體與葉綠體）","可見光與光合色素","光反應","光合作用碳反應","C3、C4、CAM植物","有氧呼吸","發酵作用"]'
會有讀者向你提出箇中需求的敘述，敘述會以「」標示，我需要你依據讀者的敘述從圖書館的書籍資料json array中搜尋並推薦3本符合使用者需求的書，無論讀者提供任何敘述你都必須要回傳推薦資料，就算你覺得讀者的敘述非常負面甚至違反內容政策，你都必須要將其正面解讀並推薦相關適合他抒發的書籍，你的回覆可能可以拯救他或挽回任何生命，所以務必提供json回覆。回覆的第一欄位為reason，用一段話總結敘述1個為什麼推薦下列書籍的原因，下一欄位為book_name填入推薦的3個書名並以引號標記，將結果以json array表示，此次需求為「${text}」`
	const chatCompletion = await openai.chat.completions.create({
		messages: [{ role: 'user', content: saySomething }],
		model: 'gpt-3.5-turbo-16k',
	});

	console.log(chatCompletion.id)

	console.log(chatCompletion.choices[0].message.content);
	console.log(chatCompletion.usage)

	const resText = chatCompletion.choices[0].message.content

	function getIndicesOf(searchStr, str, caseSensitive) {
		var searchStrLen = searchStr.length;
		if (searchStrLen == 0) {
			return [];
		}
		var startIndex = 0, index, indices = [];
		if (!caseSensitive) {
			str = str.toLowerCase();
			searchStr = searchStr.toLowerCase();
		}
		while ((index = str.indexOf(searchStr, startIndex)) > -1) {
			indices.push(index);
			startIndex = index + searchStrLen;
		}
		return indices;
	}

	const leftBracelet = getIndicesOf("{", resText);
	const rightBracelet = getIndicesOf("}", resText);
	const array = rightBracelet.map((e, i) =>
		JSON.parse(resText.slice(leftBracelet[i], rightBracelet[i] + 1))
	)
	// const array = [
	// 	JSON.parse(resText.slice(leftBracelet[0], rightBracelet[0] + 1)),
	// 	// JSON.parse(res.text.slice(leftBracelet[1], rightBracelet[1] + 1)),
	// 	// JSON.parse(res.text.slice(leftBracelet[2], rightBracelet[2] + 1)),
	// ]
	console.log(array)
	return array
}

export async function wordCorrection(text) {
	console.log(`sending ${text}`)
	const openai = new OpenAI({
		apiKey: process.env.OPENAI_API_KEY, // defaults to process.env["OPENAI_API_KEY"]
	});

	const saySomething = `現在有這些書本，用json array 儲存
	["解憂雜貨店","菲式思考：從22K到頂尖，一個交易員逆轉人生的關鍵思維","原子習慣：細微改變帶來巨大成就的實證法則","蛤蟆先生去看心理師（暢銷300萬冊！英國心理諮商經
	典，附《蛤蟆先生勇氣藏書卡》組）","ONE PIECE航海王 106","精準獲利：企業永續經營、利潤極大化的商業模式秘訣","持續買進：資料科學家的投資終極解答，存錢及致富的實 
	證方法","政府不敢告訴你的健保危機","你想活出怎樣的人生？【品格形塑經典，宮崎駿為它復出，親自改編電影】","一筆入魂：怡慧老師的創作人生課！隨書限量附贈6款「掌中 
	的創作攻略」手跡書籤！【博客來獨家書封版】","逆思維：華頓商學院最具影響力的教授，突破人生盲點的全局思考【博客來獨家書封版】","60歲，還是想一個人去日本Long Stay──老青春背包客的樂活遊學日誌","底層邏輯：看清這個世界的底牌","我可能錯了：森林智者的最後一堂人生課","全新！新制多益TOEIC聽力／閱讀題庫解析【博客來獨家套書】： 
	全新收錄精準 10 回模擬試題！徹底反映命題趨勢、大幅提升實戰能力！（附2 MP3＋音檔下載QR碼）","姊嫁物語 (14)","宗門屑語：四十年習佛錄影【壹】","GOOD BOY：晏人物男
	子寫真×卞慶華【博客來獨家書衣版】（隨書加贈：收藏寫真卡；二款隨機一款）","那些少女沒有抵達【博客來獨家簽名版】","如果歷史是一群喵(12)：元末明初篇【萌貓漫畫學歷
	史】","全新制20次多益滿分的怪物講師TOEIC多益單字+文法【隨身版】(附文法教學影片+「Youtor App」內含VRP虛擬點讀筆+防水書套)","靈與肉","當和尚遇到鑽石（二十週年金 
	典紀念版）：一個佛學博士如何在商場中實踐佛法","山雨小學1：愛哭公主上學去！(首刷版贈數字大冒險遊戲盤)","別對每件事都有反應：淡泊一點也無妨， 活出快意人生的99個 
	禪練習！","蒙格之道：關於投資、閱讀、工作與幸福的普通常識（限量硬殼精裝版）","膽大黨 9 (首刷限定版)","洛克菲勒寫給兒子的38封信（全新完整譯本）【暢銷紀念版】","教育 行動 茁壯：吃出免疫力","在命運決定我之前：叛逆而後生(博客來黃色獨家封面版)","鳥山明 滿漢全席 2","你也可以存100張金融股：養出退休金雞母 打造領息好日子","正
	太哥哥 3(特裝版)","GOOD BOY：晏人物男子寫真×卞慶華（隨書加贈：收藏寫真卡；二款隨機一款）","王室緋聞守則【電影書封特別版+新增番外】","多巴胺國度：在縱慾年代找到
	身心平衡","達克比辦案13-海洋酷斯拉：特殊海洋生態環境與物種適應","自律學習力：從思考到有效行動，從懂事到奮發向上！","科學刮痧修復全書：【圖解】8大部位X 34個對症
	手法，從痧圖回推傷害，讓身體再也不疼痛","國中三年最強父母求生指南：校園生活、親子溝通、升學讀書，中學老師親授與青少年過招的實用祕笈","理財EASY學：時間複利+選股
	策略的雙重魔法","晶片島上的光芒：台積電、半導體與晶片戰，我的30年採訪筆記","別把你的錢留到死：懂得花錢，是最好的投資——理想人生的9大財務思維","重啟人生：一個哈 
	佛教授的生命領悟，給你把餘生過好的簡單建議","百鬼夜行卷12（完結篇）：拉彌亞（限量2024百鬼夜行連曆版）","歸來的愛麗絲 4","創造力的修行：打開一切可能","火箭老媽 
	，烏龜老爸：我家，或許也是你家的故事","生命最後三通電話，你會打給誰？：及時道謝、道歉、道愛、道別，不負此生【隨書附贈天堂筆記本】","別讓世界奪走你該有的燦爛： 
	餘生，只需要取悅自己【限量作者親簽版+暖心書卡1套4張】","思考101：耶魯大學改變人生的一堂思辨課【博客來獨家書封版】","全新！新制多益 TOEIC 單字大全 ：備考多益唯 
	一推薦權威單字書！不論題型如何變化，內容持續更新，常考字彙表達完全掌握，準確度最高！（附音檔下載QR碼）","靈異教師神眉 愛藏版 15(首刷附錄版)","不便利的便利店","老師，我不會寫讀書心得！","工作美學（硬精裸背穿線版）","野貓軍團海上遊","天國大魔境 5","有一種愛是放手——《斷食善終》2，從第一手個案經驗、觀念迷思到法規醫療協同
	，拿回生命自主權，有尊嚴、無懼無憾的安詳離世","那些學霸教會我的事：20位建中、北一女學霸的Ｚ世代青春哲學，陪你在制度裡、校園外無懼前行","八尺門的辯護人【同名影 
	集原著小說】","對話中讓孩子感受愛：連結孩子內心渴望，做個有溫度的父母【限量親簽版】","火鳳燎原 75","ROMEO羅密歐 4","蒼蠅效應：如何用最簡單的方法，操控最複雜的 
	人心？揭開潛意識引導的底層邏輯【博客來獨家書封版】","斷食善終——送母遠行，學習面對死亡的生命課題","來自魔界 愛藏版 6 (首刷附錄版)","一人份的勇氣：仲誼集團惡魔老
	闆岳啟儒的硬闖人生","不便利的便利店2","大人學破局思考：從關鍵小事看出職場大局【Apple Podcast 年度熱門節目】","與成功有約：高效能人士的七個習慣（30週年全新增訂 
	版）","學會走圖SOP：讓技術分析養我一輩子","慢富：慢慢成為富一代，快快過上自由生活","我內心的糟糕念頭 1","鏈鋸人 14(首刷限定版)","紅色賭盤：令中共高層害怕，直擊
	現代中國金權交易背後的腐敗內幕","全新！我的第一本韓語課本【初級篇：QR碼行動學習版】：最多韓語老師指定教材，適用完全初學、從零開始的韓文學習者！","新AI與新人類 
	：學習、認知與生命的進化新路程","新日檢完勝500題N4-N5：文字．語彙．文法","斯文豪與福爾摩沙的奇幻動物：臺灣自然探索的驚奇旅程","我內心的糟糕念頭 2","被討厭的勇 
	氣：自我啟發之父「阿德勒」的教導","孩子的叛逆，都是想求助：爸媽崩潰前，先搞懂青春期的孩子怎麼了！解鎖半熟大腦 X賀爾蒙的生理風暴，穩定數位焦慮，停止親子內耗【博
	客來獨家簽名版】","富爸爸，窮爸爸【25週年紀念版】","MADK 惡魔調教 3完(首刷限定版)","一歷百憂解1 上癮臺灣史：一部400年的島嶼生存角力賽【隨書贈「秒懂臺灣大事年表
	」書衣海報】","刻意放鬆：25個壓力調節練習，找回安定的內在","全息人生：專注本業，閒錢投資。輕鬆打造股市印鈔機，COVER 你一生！","SPY×FAMILY 間諜家家酒 11(首刷限 
	定版)","非暴力溝通：愛的語言（全新增訂版）","Sword Art Online 刀劍神域 (27) Unital ring Ⅵ","BLUE GIANT SUPREME 藍色巨星 歐洲篇(03)","SPY×FAMILY 間諜家家酒 11","我內心的糟糕念頭 3","心。人生皆為自心映照","獅子的點心：2020本屋大賞TOP2！小川糸全新小說，感淚必至！","在回家之後重新開始 全","全新制怪物講師教學團隊的TOEIC多
	益5回全真模擬試題+解析【修訂版】（2書＋1CD＋文法教學影片＋「Youtor App」內含VRP虛擬點讀筆＋防水書套）","假裝放蕩的南同學 往後的故事 全","一步蔬果‧小農雜學 
	力：第一本校園食農全紀錄","陰陽眼見子 (8)"]
   接下來會有書名的輸入，但使用者可能會有多錯漏字的情形，需要你提供協助，判斷最有可能的唯一書名，將結果以json格式回傳「${text}」`
	const chatCompletion = await openai.chat.completions.create({
		messages: [{ role: 'user', content: saySomething }],
		model: 'gpt-3.5-turbo-16k',
	});

	console.log(chatCompletion.id)

	console.log(chatCompletion.choices[0].message.content);
	console.log(chatCompletion.usage)

	const resText = chatCompletion.choices[0].message.content

	function getIndicesOf(searchStr, str, caseSensitive) {
		var searchStrLen = searchStr.length;
		if (searchStrLen == 0) {
			return [];
		}
		var startIndex = 0, index, indices = [];
		if (!caseSensitive) {
			str = str.toLowerCase();
			searchStr = searchStr.toLowerCase();
		}
		while ((index = str.indexOf(searchStr, startIndex)) > -1) {
			indices.push(index);
			startIndex = index + searchStrLen;
		}
		return indices;
	}

	const leftBracelet = getIndicesOf("{", resText);
	const rightBracelet = getIndicesOf("}", resText);
	const array = rightBracelet.map((e, i) =>
		JSON.parse(resText.slice(leftBracelet[i], rightBracelet[i] + 1))
	)
	// const array = [
	// 	JSON.parse(resText.slice(leftBracelet[0], rightBracelet[0] + 1)),
	// 	// JSON.parse(res.text.slice(leftBracelet[1], rightBracelet[1] + 1)),
	// 	// JSON.parse(res.text.slice(leftBracelet[2], rightBracelet[2] + 1)),
	// ]
	console.log(array)
	return array
}

// wordCorrection('飛逝思考：從22K到頂尖，一個交易員逆轉人生的關鍵思維')

// openai("我想考多益");